In [3]:
import pandas as pd
df = pd.read_csv(r"C:\Users\LENOVO\Projects\feature_engineering\Titanic-Dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
#is age and cabin have any relationship. YES --- This was missing due to some reason,this data is collected after the incident,so that person or his/her family members not alive to give age and cabin data.

In [6]:
#embarked - which station picked and dropped. --- TYPE1 : Missing Completely at Random(MCAR)
df[df['Embarked'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [14]:
#TYPE 2 : Missing data Not At Random(MNAR) : Systematic missing values.
#age and cabin
import numpy as np
df["Cabin_null"]= np.where(df["Cabin"].isnull() , 1 , 0)

#find percentafe of null values
df['Cabin_null'].mean()

0.7710437710437711

In [15]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Cabin_null'],
      dtype='object')

In [27]:
#Cabin_null and Survived -- Missing Data At Random
#In Survived Feature--> 0: Dead , 1: Alive
#['Cabin_null'].mean()
df.groupby(['Survived'])['Cabin_null'].mean()

Survived
0    0.876138
1    0.602339
Name: Cabin_null, dtype: float64

In [28]:
#TYPE 3 -- Missing At Randim(MAR)
#women - hiding age , men - hiding salary

Techniques of handling missing values:

1)Mean / Median / Mode Replacement

2)Random sample imputation

3)Capturing NAN Values with a new feature

4)End of distribution imputation

5)Arbitrary imputation

6)Frequent categories imputation

MEAN/MEDIUM IMPUTATION

When should we apply ?

Mean/median imputation has the assumption that the data are missing completely at random(MCAR)

we solve this by replacing the NAN with the most frequent occurance of the variables

In [31]:
df = pd.read_csv(r"C:\Users\LENOVO\Projects\feature_engineering\Titanic-Dataset.csv",usecols=['Age','Fare','Survived'])
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500